---
kind: other
id: Properties.T:Autodesk.Revit.DB.FaceDetailNode
source: html/5e641b3c-eb1e-2ad3-117e-556bdb407ffb.htm
---
# FaceDetailNode Properties

Specifies whether the .NET object represents a valid Revit entity.